{
  "args": {
    "as_user": {
      "name": "as_user",
      "type": "boolean",
      "desc": "(Legacy) Pass true to post the message as the authed user. Defaults to true if the chat:write:bot scope is not included. Otherwise, defaults to false.",
      "required": false,
      "example": "true"
    },
    "attachments": {
      "name": "attachments",
      "type": "string",
      "desc": "Required unless `blocks`, `text` is passed. A JSON-based array of structured attachments, presented as a URL-encoded string.",
      "required": false,
      "example": "[{\"pretext\": \"pre-hello\", \"text\": \"text-world\"}]"
    },
    "blocks": {
      "name": "blocks",
      "type": "blocks[] as string",
      "desc": "Required unless `attachments`, `text` is passed. A JSON-based array of structured blocks, presented as a URL-encoded string.",
      "required": false,
      "example": "[{\"type\": \"section\", \"text\": {\"type\": \"plain_text\", \"text\": \"Hello world\"}}]"
    },
    "channel": {
      "name": "channel",
      "type": "string",
      "desc": "Channel, private group, or IM channel to send message to. Can be an encoded ID, or a name.",
      "required": true,
      "example": "C1234567890"
    },
    "icon_emoji": {
      "name": "icon_emoji",
      "type": "string",
      "desc": "Emoji to use as the icon for this message. Overrides icon_url.",
      "required": false,
      "example": ":chart_with_upwards_trend:"
    },
    "icon_url": {
      "name": "icon_url",
      "type": "string",
      "desc": "URL to an image to use as the icon for this message.",
      "required": false,
      "example": "http://lorempixel.com/48/48"
    },
    "link_names": {
      "name": "link_names",
      "type": "boolean",
      "desc": "Find and link channel names and usernames.",
      "required": false,
      "example": "true"
    },
    "parse": {
      "name": "parse",
      "type": "string",
      "desc": "Change how messages are treated. Defaults to none. See below.",
      "required": false,
      "example": "full"
    },
    "text": {
      "name": "text",
      "type": "string",
      "desc": "Required unless `attachments`, `blocks` is passed. How this field works and whether it is required depends on other fields you use in your API call. See below for more detail.",
      "required": false,
      "example": "Hello world"
    },
    "thread_ts": {
      "name": "thread_ts",
      "type": "string",
      "desc": "Provide another message's ts value to post this message in a thread. Avoid using a reply's ts value; use its parent's value instead. Ephemeral messages in threads are only shown if there is already an active thread.",
      "required": false,
      "example": "1234567890.123456"
    },
    "token": {
      "name": "token",
      "type": "token",
      "desc": "Authentication token bearing required scopes. Tokens should be passed as an HTTP Authorization header or alternatively, as a POST parameter.",
      "required": true,
      "example": "xxxx-xxxxxxxxx-xxxx"
    },
    "user": {
      "name": "user",
      "type": "string",
      "desc": "id of the user who will receive the ephemeral message. The user should be in the channel specified by the channel argument.",
      "required": true,
      "example": "U0BPQUNTA"
    },
    "username": {
      "name": "username",
      "type": "string",
      "desc": "Set your bot's user name.",
      "required": false,
      "example": "My Bot"
    }
  },
  "name": "chat.postEphemeral",
  "link": "/methods/chat.postEphemeral",
  "desc": "Sends an ephemeral message to a user in a channel.",
  "response": {
    "message_ts": "1502210682.580145",
    "ok": true
  },
  "errors": {
    "invalid_blocks_format": "The blocks is not a valid JSON object or doesn't match the Block Kit syntax.",
    "invalid_auth": "Some aspect of authentication cannot be validated. Either the provided token is invalid or the request originates from an IP address disallowed from making the request.",
    "channel_not_found": "Value passed for channel was invalid.",
    "is_archived": "Channel has been archived.",
    "messages_tab_disabled": "Messages tab for the app is disabled.",
    "invalid_array_arg": "The method was passed an array as an argument. Please only input valid strings.",
    "invalid_blocks": "Blocks submitted with this message are not valid",
    "token_expired": "Authentication token has expired",
    "account_inactive": "Authentication token is for a deleted user or workspace when using a bot token.",
    "request_timeout": "The method was called via a POST request, but the POST data was either missing or truncated.",
    "not_authed": "No authentication token provided.",
    "too_many_attachments": "Too many attachments were provided with this message. A maximum of 100 attachments are allowed on a message.",
    "ratelimited": "The request has been ratelimited. Refer to the Retry-After header for when to retry the request.",
    "deprecated_endpoint": "The endpoint has been deprecated.",
    "restricted_action": "A workspace preference prevents the authenticated user from posting.",
    "invalid_arg_name": "The method was passed an argument whose name falls outside the bounds of accepted or expected values. This includes very long names and names with non-alphanumeric characters other than _. If you get this error, it is typically an indication that you have made a very malformed API call.",
    "method_deprecated": "The method has been deprecated.",
    "fatal_error": "The server could not complete your operation(s) without encountering a catastrophic error. It's possible some aspect of the operation succeeded before the error was raised.",
    "msg_too_long": "Message text is too long",
    "invalid_arguments": "The method was either called with invalid arguments or some detail about the arguments passed is invalid, which is more likely when using complex arguments like blocks or attachments.",
    "invalid_form_data": "The method was called via a POST request with Content-Typeapplication/x-www-form-urlencoded or multipart/form-data, but the form data was either missing or syntactically invalid.",
    "service_unavailable": "The service is temporarily unavailable",
    "message_limit_exceeded": "Members on this team are sending too many messages. For more details, see https://slack.com/help/articles/115002422943-Usage-limits-for-free-workspaces",
    "org_login_required": "The workspace is undergoing an enterprise migration and will not be available until migration is complete.",
    "missing_scope": "The token used is not granted the specific scope permissions required to complete this request.",
    "token_revoked": "Authentication token is for a deleted user or workspace or the app has been removed when using a user token.",
    "ekm_access_denied": "Administrators have suspended the ability to post a message.",
    "no_permission": "The workspace token used in this request does not have the permissions necessary to complete the request. Make sure your app is a member of the conversation it's attempting to post a message to.",
    "internal_error": "The server could not complete your operation(s) without encountering an error, likely due to a transient issue on our end. It's possible some aspect of the operation succeeded before the error was raised.",
    "not_allowed_token_type": "The token type used in this request is not allowed.",
    "no_text": "No message text provided",
    "enterprise_is_restricted": "The method cannot be called from an Enterprise.",
    "accesslimited": "Access to this method is limited on the current network",
    "invalid_post_type": "The method was called via a POST request, but the specified Content-Type was invalid. Valid types are: application/jsonapplication/x-www-form-urlencodedmultipart/form-datatext/plain.",
    "user_not_in_channel": "Intended recipient is not in the specified channel.",
    "two_factor_setup_required": "Two factor setup is required.",
    "team_added_to_org": "The workspace associated with your request is currently undergoing migration to an Enterprise Organization. Web API and other platform operations will be intermittently unavailable until the transition is complete.",
    "missing_post_type": "The method was called via a POST request and included a data payload, but the request did not include a Content-Type header.",
    "team_access_not_granted": "The token used is not granted the specific workspace access required to complete this request.",
    "access_denied": "Access to a resource specified in the request is denied.",
    "invalid_charset": "The method was called via a POST request, but the charset specified in the Content-Type header was invalid. Valid charset names are: utf-8iso-8859-1."
  },
  "warnings": {
    "missing_charset": "The method was called via a POST request, and recommended practice for the specified Content-Type is to include a charset parameter. However, no charset was present. Specifically, non-form-data content types (e.g. text/plain) are the ones for which charset is recommended.",
    "superfluous_charset": "The method was called via a POST request, and the specified Content-Type is not defined to understand the charset parameter. However, charset was in fact present. Specifically, form-data content types (e.g. multipart/form-data) are the ones for which charset is superfluous."
  },
  "is_deprecated": false,
  "content_types": [
    "application/x-www-form-urlencoded",
    "application/json"
  ]
}